# sql-(structured query language)

In [7]:
#creating a database file to inside we specified path
import sqlite3
conn=sqlite3.connect("E:\\DBMS\\table2.sqlite")
cursor=conn.cursor()
print("Database file connected")

Database file connected

In [8]:
#create table with different datatypes and with primarykey
conn=sqlite3.connect("E:\\DBMS\\table2.sqlite")
cursor=conn.cursor()
cursor.execute('''
               Create table baby(
                   ID numeric(4) not null unique primary key,
                   NAME char(10),
                   CODE numeric(5) not null unique,
                   JOINING_DATE date not null,
                   ADDRESS varchar2(20)
               );
               ''')
conn.close()

In [88]:
#insert values into baby table
conn=sqlite3.connect("E:\\DBMS\\table2.sqlite")
cursor=conn.cursor()
cursor.execute("insert into baby values(1,'karthik',6860,'26-09-23','annanagar,chennai')")
cursor.execute("insert into baby values(2,'reshma',6861,'26-09-23','annanagar,chennai')")
conn.commit()
conn.close()

In [10]:
#create baby1 table with forienkey
conn=sqlite3.connect("E:\\DBMS\\table2.sqlite")
cursor=conn.cursor()
cursor.execute('''
               Create table baby1(
                   EMP_CODE  not null unique primary key references baby(CODE),
                   EMP_POSITION char(20),
                   EMP_AGE numeric(2) not null
               );
               ''')
conn.close()

In [11]:
#insert values into baby1 table
conn=sqlite3.connect("E:\\DBMS\\table2.sqlite")
cursor=conn.cursor()
cursor.execute("insert into baby1 values(6860,'software Engineer',23)")
cursor.execute("insert into baby1 values(6861,'communication spaclist',23)")
conn.commit()
conn.close()

In [13]:
#create baby3 table with check constraint
conn=sqlite3.connect("E:\\DBMS\\table2.sqlite")
cursor=conn.cursor()
cursor.execute('''
               Create table baby3(
                   PHONENUMBER  not null unique primary key,
                   NAME char(20) NOT NULL,
                   AGE numeric(2) not null,
                    CITY varchar(20) not null,
                   check (age>=18)
                  
               );
               ''')
conn.close()

In [14]:
#insert values into baby3 table
conn=sqlite3.connect("E:\\DBMS\\table2.sqlite")
cursor=conn.cursor()
cursor.execute("insert into baby3 values(9944194787,'Karthik',23,'chennai')")
cursor.execute("insert into baby3 values(9944194788,'Reshma',13,'chennai')")
conn.commit()
conn.close()
#it's won't accept lessthan age18

IntegrityError: CHECK constraint failed: age>=18

In [15]:
#insert values into baby3 table
conn=sqlite3.connect("E:\\DBMS\\table2.sqlite")
cursor=conn.cursor()
cursor.execute("insert into baby3 values(9944194787,'Karthik',23,'chennai')")
cursor.execute("insert into baby3 values(9944194788,'Reshma',23,'chennai')")
conn.commit()
conn.close()
#if we give morethan 18 or 18,it will accept

In [16]:
#create baby4 table with check constraint
conn=sqlite3.connect("E:\\DBMS\\table2.sqlite")
cursor=conn.cursor()
cursor.execute('''
               Create table baby4(
                   PHONENUMBER  not null unique primary key,
                   NAME char(20) NOT NULL,
                   AGE numeric(2) not null,
                    CITY varchar(20) not null,
                   check (AGE>=18 AND CITY=='Chennai')
                  
               );
               ''')
conn.close()

In [17]:
#insert values into baby4 table
conn=sqlite3.connect("E:\\DBMS\\table2.sqlite")
cursor=conn.cursor()
cursor.execute("insert into baby4 values(9944194787,'Karthik',23,'maduri')")
cursor.execute("insert into baby4 values(9944194788,'Reshma',23,'chennai')")
conn.commit()
conn.close()
#it won't accept lassthan 18 age and except chennai

IntegrityError: CHECK constraint failed: AGE>=18 AND CITY=='Chennai'

In [18]:
#insert values into baby4 table
conn=sqlite3.connect("E:\\DBMS\\table2.sqlite")
cursor=conn.cursor()
cursor.execute("insert into baby4 values(9944194787,'Karthik',23,'Chennai')")
cursor.execute("insert into baby4 values(9944194788,'Reshma',24,'Chennai')")
conn.commit()
conn.close()
#it's accept if we give city as Chennai and age morethan 18 or 18

In [19]:
#select
#select whole table and displaying tables data using pandas
import pandas as pd
conn=sqlite3.connect("E:\\DBMS\\table2.sqlite")
cursor=conn.cursor()
query="select * from baby";
cursor.execute(query)
data=cursor.fetchall()
df1=pd.DataFrame(data)
conn.close()

In [20]:
df1

   0        1     2         3                  4
0  1  karthik  6860  26-09-23  annanagar,chennai
1  2   reshma  6861  26-09-23  annanagar,chennai

In [23]:
#select specific columns
conn=sqlite3.connect("E:\\DBMS\\table2.sqlite")
cursor=conn.cursor()
query="select ID,NAME from baby";
cursor.execute(query)
data=cursor.fetchall()
df2=pd.DataFrame(data)
print(data)
conn.close()

[(1, 'karthik'), (2, 'reshma')]

In [24]:
df2

   0        1
0  1  karthik
1  2   reshma

In [25]:
#select specific columns using Distinct statment
conn=sqlite3.connect("E:\\DBMS\\table2.sqlite")
cursor=conn.cursor()
query="select Distinct ADDRESS from baby";
cursor.execute(query)
data=cursor.fetchall()
df3=pd.DataFrame(data)
print(data)
conn.close()
#dinstict keyword not display repeted value(we have two data's same like a 'annanagar,chennai' but here displayed only one time)

[('annanagar,chennai',)]

In [26]:
df3

                   0
0  annanagar,chennai

In [27]:
#count the value of NAME column using select statment
conn=sqlite3.connect("E:\\DBMS\\table2.sqlite")
cursor=conn.cursor()
query="select count(Distinct NAME) from baby";
cursor.execute(query)
data=cursor.fetchall()
print(data)
conn.close()

[(2,)]

In [28]:
#literals operation 
conn=sqlite3.connect("E:\\DBMS\\table2.sqlite")
cursor=conn.cursor()
query="select ID,ID+10 from baby";
cursor.execute(query)
data=cursor.fetchall()
print(data)
conn.close()

[(1, 11), (2, 12)]

In [29]:
#concatination operator
conn=sqlite3.connect("E:\\DBMS\\table2.sqlite")
cursor=conn.cursor()
query="select ID||NAME from baby";
cursor.execute(query)
data=cursor.fetchall()
print(data)
conn.close()

[('1karthik',), ('2reshma',)]

In [30]:
#displaying person detils who has age 24 using where clause
conn=sqlite3.connect("E:\\DBMS\\table2.sqlite")
cursor=conn.cursor()
query="select * from baby4 where AGE==24";
cursor.execute(query)
data=cursor.fetchall()
print(data)
conn.close()

[(9944194788, 'Reshma', 24, 'Chennai')]

In [31]:
#displaying person detils who has 7 character name
conn=sqlite3.connect("E:\\DBMS\\table2.sqlite")
cursor=conn.cursor()
query="select * from baby4 where length(NAME)==7";
cursor.execute(query)
data=cursor.fetchall()
print(data)
conn.close()

[(9944194787, 'Karthik', 23, 'Chennai')]

In [32]:
#displaying person's details by in operator
conn=sqlite3.connect("E:\\DBMS\\table2.sqlite")
cursor=conn.cursor()
query="select * from baby1 where EMP_POSITION in('software Engineer','communication spaclist')";
cursor.execute(query)
data=cursor.fetchall()
print(data)
conn.close()

[(6860, 'software Engineer', 23), (6861, 'communication spaclist', 23)]

In [33]:
#displaying person's details by not in operator
conn=sqlite3.connect("E:\\DBMS\\table2.sqlite")
cursor=conn.cursor()
query="select * from baby1 where EMP_CODE not in(6860)";
cursor.execute(query)
data=cursor.fetchall()
print(data)
conn.close()

[(6861, 'communication spaclist', 23)]

In [34]:
#displaying person's details by between operator
conn=sqlite3.connect("E:\\DBMS\\table2.sqlite")
cursor=conn.cursor()
query="select * from baby1 where EMP_CODE between 6850 AND 6860";
cursor.execute(query)
data=cursor.fetchall()
print(data)
conn.close()

[(6860, 'software Engineer', 23)]

In [41]:
##displaying person's details by is operator
conn=sqlite3.connect("E:\\DBMS\\table2.sqlite")
cursor=conn.cursor()
query="select * from baby where ADDRESS is null";
cursor.execute(query)
data=cursor.fetchall()
print(data)
conn.close()
#it's displayed records which Address has null

[(5, 'mani', 6870, -10, None)]

In [36]:
##displaying person's details by is operator
conn=sqlite3.connect("E:\\DBMS\\table2.sqlite")
cursor=conn.cursor()
query="select * from baby where ADDRESS is not null";
cursor.execute(query)
data=cursor.fetchall()
print(data)
conn.close()
#it's displayed records which Address has not null

[(1, 'karthik', 6860, '26-09-23', 'annanagar,chennai'), (2, 'reshma', 6861, '26-09-23', 'annanagar,chennai')]

In [37]:
#display the employee whose name start with 'r'
conn=sqlite3.connect("E:\\DBMS\\table2.sqlite")
cursor=conn.cursor()
query="select * from baby where NAME like 'r%'";
cursor.execute(query)
data=cursor.fetchall()
print(data)
conn.close()

[(2, 'reshma', 6861, '26-09-23', 'annanagar,chennai')]

In [38]:
#display the employee whose name 2nd letter is 'a'
conn=sqlite3.connect("E:\\DBMS\\table2.sqlite")
cursor=conn.cursor()
query="select * from baby where NAME like '_a%'";
cursor.execute(query)
data=cursor.fetchall()
print(data)
conn.close()

[(1, 'karthik', 6860, '26-09-23', 'annanagar,chennai')]

In [42]:
#display the employee whose name has 4 letters
conn=sqlite3.connect("E:\\DBMS\\table2.sqlite")
cursor=conn.cursor()
query="select * from baby where NAME like '____'";
cursor.execute(query)
data=cursor.fetchall()
print(data)
conn.close()

[(5, 'mani', 6870, -10, None)]

In [43]:
#sort the recodrs as accending order by their names using orderbyclass
conn=sqlite3.connect("E:\\DBMS\\table2.sqlite")
cursor=conn.cursor()
query="select * from baby order by NAME ASC";
cursor.execute(query)
data=cursor.fetchall()
print(data)
conn.close()

[(1, 'karthik', 6860, '26-09-23', 'annanagar,chennai'), (5, 'mani', 6870, -10, None), (2, 'reshma', 6861, '26-09-23', 'annanagar,chennai')]

In [44]:
#sort the recodrs as decending order by their id using orderbyclass
conn=sqlite3.connect("E:\\DBMS\\table2.sqlite")
cursor=conn.cursor()
query="select * from baby order by ID DESC";
cursor.execute(query)
data=cursor.fetchall()
print(data)
conn.close()

[(5, 'mani', 6870, -10, None), (2, 'reshma', 6861, '26-09-23', 'annanagar,chennai'), (1, 'karthik', 6860, '26-09-23', 'annanagar,chennai')]

In [45]:
#create new table from Existing table
conn=sqlite3.connect("E:\\DBMS\\table2.sqlite")
cursor=conn.cursor()
query="create table baby5 As select * from baby";
cursor.execute(query)
conn.close()

In [ ]:
#displaying baby5 table
conn=sqlite3.connect("E:\\DBMS\\table1.sqlite")
cursor=conn.cursor()
query="select * from baby5";
cursor.execute(query)
data=cursor.fetchall()
print(data)
conn.close()

In [46]:
#droping baby5 table
conn=sqlite3.connect("E:\\DBMS\\table2.sqlite")
cursor=conn.cursor()
query="drop table baby5";
cursor.execute(query)
print("drop successfully")
conn.close()

drop successfully

In [47]:
#tryiing to display deleteed table
conn=sqlite3.connect("E:\\DBMS\\table2.sqlite")
cursor=conn.cursor()
query="select * from baby5";
cursor.execute(query)
data=cursor.fetchall()
print(data)
conn.close()

OperationalError: no such table: baby5

In [48]:
#adding new column into baby4 table
conn=sqlite3.connect("E:\\DBMS\\table2.sqlite")
cursor=conn.cursor()
query="alter table baby4 add DEGREE varchar(20)";
cursor.execute(query)
print("new column added!!!")
conn.close()

new column added!!!

In [49]:
#renaming column name in baby4 table
conn=sqlite3.connect("E:\\DBMS\\table2.sqlite")
cursor=conn.cursor()
query="alter table baby4 rename column DEGREE to Degree";
cursor.execute(query)
print("rename successfully!!!")
conn.close()

rename successfully!!!

In [51]:
#removing column in baby4 table
conn=sqlite3.connect("E:\\DBMS\\table2.sqlite")
cursor=conn.cursor()
query="alter table baby4 drop column Degree";
cursor.execute(query)
print("deleted successfully!!!")
conn.close()

deleted successfully!!!

In [52]:
#deleting particular row using delete command with condition
conn=sqlite3.connect("E:\\DBMS\\table2.sqlite")
cursor=conn.cursor()
query="delete from baby4 where AGE='23'";
cursor.execute(query)
conn.commit()
print("deleted successfully!!!")
conn.close()

deleted successfully!!!

In [53]:
#deleting all row using delete command 
conn=sqlite3.connect("E:\\DBMS\\table2.sqlite")
cursor=conn.cursor()
query="delete from baby4";
cursor.execute(query)
conn.commit()
print("deleted successfully!!!")
conn.close()

deleted successfully!!!

In [54]:
#update one row using update command 
conn=sqlite3.connect("E:\\DBMS\\table2.sqlite")
cursor=conn.cursor()
query="update baby3 set CITY='Madurai' where NAME='Karthik'";
cursor.execute(query)
conn.commit()
print("updated successfully!!!")
conn.close()

updated successfully!!!

In [55]:
#update more than one row using update command 
conn=sqlite3.connect("E:\\DBMS\\table2.sqlite")
cursor=conn.cursor()
query="update baby3 set AGE='24' where NAME in('Karthik','Reshma')";
cursor.execute(query)
conn.commit()
print("updated successfully!!!")
conn.close()

updated successfully!!!

In [64]:
#deleting baby3 table for rollback
conn=sqlite3.connect("E:\\DBMS\\table2.sqlite")
cursor=conn.cursor()
query="delete from baby3";
cursor.execute(query)
conn.commit()
print("deleted successfully!!!")
#conn.close()

deleted successfully!!!

In [65]:
#rollback command 
conn=sqlite3.connect("E:\\DBMS\\table2.sqlite")
cursor=conn.cursor()
conn.rollback()
print("rollback successfully!!!")
conn.close()
#but data not rollbaced in the table cause we did commit above cell

rollback successfully!!!

In [90]:
#case manipulation functions
#upper
conn=sqlite3.connect("E:\\DBMS\\table2.sqlite")
cursor=conn.cursor()
query="select upper(NAME) from baby" 
cursor.execute(query)
data=cursor.fetchall()
print(data)
conn.close()

[('KARTHIK',), ('RESHMA',)]

In [91]:
#lower
conn=sqlite3.connect("E:\\DBMS\\table2.sqlite")
cursor=conn.cursor()
query="select LOWER(NAME) from baby" 
cursor.execute(query)
data=cursor.fetchall()
print(data)
conn.close()

[('karthik',), ('reshma',)]

In [98]:
#change the Name character to upper case and update into the table
conn=sqlite3.connect("E:\\DBMS\\table2.sqlite")
cursor=conn.cursor()
query="update baby set NAME=upper(NAME)" ;
cursor.execute(query)
conn.commit()
#print(data)
conn.close()

In [99]:
#Character manipulation functions
#replace()
conn=sqlite3.connect("E:\\DBMS\\table2.sqlite")
cursor=conn.cursor()
query="select replace(NAME,'A','$') from baby" 
cursor.execute(query)
data=cursor.fetchall()
print(data)
conn.close()

[('K$RTHIK',), ('RESHM$',)]

In [111]:
#substr(substring)
conn=sqlite3.connect("E:\\DBMS\\table2.sqlite")
cursor=conn.cursor()
query="select substr(NAME,2,5) from baby" 
cursor.execute(query)
data=cursor.fetchall()
print(data)
query2="select substr(NAME,-1) from baby" 
cursor.execute(query2)
data2=cursor.fetchall()
print(data2)
conn.close()

[('ARTHI',), ('ESHMA',)]
[('K',), ('A',)]

In [114]:
#concat()
conn=sqlite3.connect("E:\\DBMS\\table2.sqlite")
cursor=conn.cursor()
query="select NAME || CODE from baby" 
cursor.execute(query)
data=cursor.fetchall()
print(data)
query2="select 'MY'||'NAME is:'||NAME from baby" 
cursor.execute(query2)
data2=cursor.fetchall()
print(data2)
conn.close()

[('KARTHIK6860',), ('RESHMA6861',)]
[('MYNAME is:KARTHIK',), ('MYNAME is:RESHMA',)]

In [147]:
#instr()
conn=sqlite3.connect("E:\\DBMS\\table2.sqlite")
cursor=conn.cursor()
cursor.execute("select INSTR(name,'K',1) from baby")
data=cursor.fetchall()
print(data)
#query2="select 'MY'||'NAME is:'||NAME from baby" 
#cursor.execute(query2)
#data2=cursor.fetchall()
#print(data2)
conn.close()

OperationalError: wrong number of arguments to function INSTR()

In [132]:
#ltrim()
conn=sqlite3.connect("E:\\DBMS\\table2.sqlite")
cursor=conn.cursor()
query="select ltrim(NAME,'R') from baby" 
cursor.execute(query)
data=cursor.fetchall()
print(data)
conn.close()

[('KARTHIK',), ('ESHMA',)]

In [133]:
#ltrim()
conn=sqlite3.connect("E:\\DBMS\\table2.sqlite")
cursor=conn.cursor()
query="select rtrim(NAME,'K') from baby" 
cursor.execute(query)
data=cursor.fetchall()
print(data)
conn.close()

[('KARTHI',), ('RESHMA',)]

In [171]:
#adding new salary column for multirow functions
conn=sqlite3.connect("E:\\DBMS\\table2.sqlite")
cursor=conn.cursor()
query="alter table baby add salary numeric(5)" 
cursor.execute(query)
query2="update baby set salary=case when ID=1 then 70000 when ID=2 then 60000 end where ID in(1,2)" 
cursor.execute(query2)
conn.commit()
conn.close()

In [174]:
#multirow functions
conn=sqlite3.connect("E:\\DBMS\\table2.sqlite")
cursor=conn.cursor()
for i in cursor.execute("select min(salary),max(salary),sum(salary),AVG(salary),count(salary) from baby"):
    print("minimum:",i[0])
    print("maximunm:",i[1])
    print("sum:",i[2])
    print("average",i[3])
    print("count:",i[4])
conn.close()

minimum: 60000
maximunm: 70000
sum: 130000
average 65000.0
count: 2

In [183]:
#creating new table for groupby statement
conn=sqlite3.connect("E:\\DBMS\\table2.sqlite")
cursor=conn.cursor()
query='''
create table baby6(
 EMP_ID not null unique primary key,
 EMP_NAME varchar(20),
 CITY varchar(20),
 SALARY numeric(6)
);
'''
cursor.execute(query)
print("table created!!!!")
#inseting values into the table
cursor.execute("INSERT INTO baby6 values(6860,'karthik','chennai',150000)")
cursor.execute("INSERT INTO baby6 values(6862,'Reshma','chennai',100000)")
cursor.execute("INSERT INTO baby6 values(6868,'mani','madurai',50000)")
cursor.execute("INSERT INTO baby6 values(6876,'Rajesh','salem',60000)")
cursor.execute("INSERT INTO baby6 values(6877,'raj','madurai',230000)")
cursor.execute("INSERT INTO baby6 values(6879,'kalam','coimbatore',10000)")
cursor.execute("INSERT INTO baby6 values(6859,'Azula','salem',18000)")
cursor.execute("INSERT INTO baby6 values(6855,'Bala','coimbatore',20000)")
cursor.execute("INSERT INTO baby6 values(6832,'gani','salem',64000)")
cursor.execute("INSERT INTO baby6 values(6822,'Abi','chennai',70000)")
conn.commit()
conn.close()

table created!!!!

In [185]:
#finding each city Average salary using groupby clause
conn=sqlite3.connect("E:\\DBMS\\table2.sqlite")
cursor=conn.cursor()
query='''
select CITY,avg(SALARY)
from baby6
group by CITY
'''
cursor.execute(query)
data=cursor.fetchall()
print(data)
conn.close()

[('chennai', 106666.66666666667), ('coimbatore', 15000.0), ('madurai', 140000.0), ('salem', 47333.333333333336)]

In [207]:
#finding whoever getting morethan 100000 salary and living in chennai
conn=sqlite3.connect("E:\\DBMS\\table2.sqlite")
cursor=conn.cursor()
query='''
select * from baby6 where SALARY in (select SALARY from baby6 where SALARY>=100000 and CITY='chennai')
'''
cursor.execute(query)
data=cursor.fetchall()
print(data)
conn.close()

[(6860, 'karthik', 'chennai', 150000), (6862, 'Reshma', 'chennai', 100000)]

In [209]:
#finding whoever staying in madurai and getting sla
conn=sqlite3.connect("E:\\DBMS\\table2.sqlite")
cursor=conn.cursor()
query='''
select * from baby6 where salary in (select SALARY from baby6 where CITY='madurai' and SALARY=50000)
'''
cursor.execute(query)
data=cursor.fetchall()
print(data)
conn.close()

[(6868, 'mani', 'madurai', 50000)]

In [210]:
#cartision join or cross join
conn=sqlite3.connect("E:\\DBMS\\table2.sqlite")
cursor=conn.cursor()
query='''
select NAME,EMP_NAME from baby,baby6
'''
cursor.execute(query)
data=cursor.fetchall()
print(data)
conn.close()

[('KARTHIK', 'karthik'), ('KARTHIK', 'Reshma'), ('KARTHIK', 'mani'), ('KARTHIK', 'Rajesh'), ('KARTHIK', 'raj'), ('KARTHIK', 'kalam'), ('KARTHIK', 'Azula'), ('KARTHIK', 'Bala'), ('KARTHIK', 'gani'), ('KARTHIK', 'Abi'), ('RESHMA', 'karthik'), ('RESHMA', 'Reshma'), ('RESHMA', 'mani'), ('RESHMA', 'Rajesh'), ('RESHMA', 'raj'), ('RESHMA', 'kalam'), ('RESHMA', 'Azula'), ('RESHMA', 'Bala'), ('RESHMA', 'gani'), ('RESHMA', 'Abi')]

In [212]:
#innerjoin
conn=sqlite3.connect("E:\\DBMS\\table2.sqlite")
cursor=conn.cursor()
query='''
select baby.NAME,baby6.EMP_NAME from baby,baby6 where baby.CODE=baby6.EMP_ID
'''
cursor.execute(query)
data=cursor.fetchall()
print(data)
conn.close()

[('KARTHIK', 'karthik')]

In [220]:
#leftouterjoin
conn=sqlite3.connect("E:\\DBMS\\table2.sqlite")
cursor=conn.cursor()
query='''
select baby.NAME,baby6.EMP_NAME from baby left outer join baby6 on baby.CODE=baby6.EMP_ID
'''
cursor.execute(query)
data=cursor.fetchall()
print(data)
conn.close()

[('KARTHIK', 'karthik'), ('RESHMA', None)]

In [221]:
#rightouterjoin
conn=sqlite3.connect("E:\\DBMS\\table2.sqlite")
cursor=conn.cursor()
query='''
select baby.NAME,baby6.EMP_NAME from baby right outer join baby6 on baby.CODE=baby6.EMP_ID
'''
cursor.execute(query)
data=cursor.fetchall()
print(data)
conn.close()

[('KARTHIK', 'karthik'), (None, 'Reshma'), (None, 'mani'), (None, 'Rajesh'), (None, 'raj'), (None, 'kalam'), (None, 'Azula'), (None, 'Bala'), (None, 'gani'), (None, 'Abi')]

In [222]:
#full outer join
conn=sqlite3.connect("E:\\DBMS\\table2.sqlite")
cursor=conn.cursor()
query='''
select baby.NAME,baby6.EMP_NAME from baby full outer join baby6 on baby.CODE=baby6.EMP_ID
'''
cursor.execute(query)
data=cursor.fetchall()
print(data)
conn.close()

[('KARTHIK', 'karthik'), ('RESHMA', None), (None, 'Reshma'), (None, 'mani'), (None, 'Rajesh'), (None, 'raj'), (None, 'kalam'), (None, 'Azula'), (None, 'Bala'), (None, 'gani'), (None, 'Abi')]

In [228]:
#creating a table for selfjoin
conn=sqlite3.connect("E:\\DBMS\\table2.sqlite")
cursor=conn.cursor()
query='''
create table baby7 AS select * from baby6
'''
cursor.execute(query)
#add code column into the table
query2="alter table baby7 add COMPANY_CODE numeric(4)"
cursor.execute(query2)
#add values into the COMPANY_CODE column of bab7 table
query3="update baby7 set COMPANY_CODE=6860 where EMP_ID in(6860,6868)"
cursor.execute(query3)
query4="update baby7 set COMPANY_CODE=6822 where EMP_ID in(6855,6859)"
cursor.execute(query4)
conn.commit()
conn.close()

In [234]:
#self join
conn=sqlite3.connect("E:\\DBMS\\table2.sqlite")
cursor=conn.cursor()
query='''
select e.EMP_NAME,c.CITY from baby7 e,baby7 c where e.COMPANY_CODE=c.EMP_ID
'''
cursor.execute(query)
data=cursor.fetchall()
print(data)
conn.close()

[('karthik', 'chennai'), ('mani', 'chennai'), ('Azula', 'chennai'), ('Bala', 'chennai')]

In [238]:
#having clause
#finding the each city total sum value salary and display only which city has lenght of 5
conn=sqlite3.connect("E:\\DBMS\\table2.sqlite")
cursor=conn.cursor()
query='''
select CITY,SUM(SALARY)
from baby6 
group by CITY
having length(city)=5
'''
cursor.execute(query)
data=cursor.fetchall()
print(data)
conn.close()

[('salem', 142000)]

In [239]:
#Aliases name
conn=sqlite3.connect("E:\\DBMS\\table2.sqlite")
cursor=conn.cursor()
query='''
select EMP_NAME as name from baby6
'''
cursor.execute(query)
data=cursor.fetchall()
print(data)
conn.close()

[('karthik',), ('Reshma',), ('mani',), ('Rajesh',), ('raj',), ('kalam',), ('Azula',), ('Bala',), ('gani',), ('Abi',)]

In [253]:
#case expression
#find the salary whoever getting morethan 100000 ruppes and lessthan 10000 rupees,equalto 10000 rupees
conn=sqlite3.connect("E:\\DBMS\\table2.sqlite")
cursor=conn.cursor()
query='''
select EMP_NAME,SALARY,
case
when SALARY>100000 then "Morethan 100000 rupess"
when SALARY=100000 then "equalto 100000 rupees"
else "lessthan 100000 rupees"
end
from baby6
'''
cursor.execute(query)
data=cursor.fetchall()
print(data)
conn.close()

[('karthik', 150000, 'Morethan 100000 rupess'), ('Reshma', 100000, 'equalto 100000 rupees'), ('mani', 50000, 'lessthan 100000 rupees'), ('Rajesh', 60000, 'lessthan 100000 rupees'), ('raj', 230000, 'Morethan 100000 rupess'), ('kalam', 10000, 'lessthan 100000 rupees'), ('Azula', 18000, 'lessthan 100000 rupees'), ('Bala', 20000, 'lessthan 100000 rupees'), ('gani', 64000, 'lessthan 100000 rupees'), ('Abi', 70000, 'lessthan 100000 rupees')]

In [259]:
#comments
conn=sqlite3.connect("E:\\DBMS\\table2.sqlite")
cursor=conn.cursor()
query='''
select EMP_NAME from baby6 --where EMP_ID=6860
'''
cursor.execute(query)
data=cursor.fetchall()
print(data)
query1='''
select EMP_NAME from baby6
/*
where EMP_ID=6860 
order by SALARY*/
'''
cursor.execute(query1)
data1=cursor.fetchall()
print(data1)
conn.close()

[('karthik',), ('Reshma',), ('mani',), ('Rajesh',), ('raj',), ('kalam',), ('Azula',), ('Bala',), ('gani',), ('Abi',)]
[('karthik',), ('Reshma',), ('mani',), ('Rajesh',), ('raj',), ('kalam',), ('Azula',), ('Bala',), ('gani',), ('Abi',)]

In [263]:
#select into statement
#copy the data who are working in chennai to new table
conn=sqlite3.connect("E:\\DBMS\\table2.sqlite")
cursor=conn.cursor()
query='''
select  * into chennai from baby6 where CITY='chennai'
'''
cursor.execute(query)
print("table created!!!")
conn.commit()
conn.close()
#in sqlite not support select into statement

OperationalError: near "into": syntax error

In [264]:
#if we want to make chennai tbale we can use below code
conn=sqlite3.connect("E:\\DBMS\\table2.sqlite")
cursor=conn.cursor()
query='''
create table chennai as select  * from baby6 where CITY='chennai'
'''
cursor.execute(query)
print("table created!!!")
conn.commit()
conn.close()

table created!!!

In [266]:
#insert into select statement
#copy baby6 table madurai city rows to chennai table
conn=sqlite3.connect("E:\\DBMS\\table2.sqlite")
cursor=conn.cursor()
query='''
insert into chennai
select * from baby6
where CITY='madurai'
'''
cursor.execute(query)
conn.commit()
conn.close()

In [275]:
#rownum
conn=sqlite3.connect("E:\\DBMS\\table2.sqlite")
cursor=conn.cursor()
query='''
select EMP_NAME,ROWid FROM baby6
'''
cursor.execute(query)
data=cursor.fetchall()
print(data)
conn.close()

[('karthik', 1), ('Reshma', 2), ('mani', 3), ('Rajesh', 4), ('raj', 5), ('kalam', 6), ('Azula', 7), ('Bala', 8), ('gani', 9), ('Abi', 10)]

In [279]:
#core related subquries (exists)
conn=sqlite3.connect("E:\\DBMS\\table2.sqlite")
cursor=conn.cursor()
query='''
select EMP_NAME from baby6 where exists(select CODE from baby where baby.CODE=baby6.EMP_ID)
'''
cursor.execute(query)
data=cursor.fetchall()
print(data)
conn.close()

[('karthik',)]

In [280]:
#core related subquries (not exists)
conn=sqlite3.connect("E:\\DBMS\\table2.sqlite")
cursor=conn.cursor()
query='''
select EMP_NAME from baby6 where not exists(select CODE from baby where baby.CODE=baby6.EMP_ID)
'''
cursor.execute(query)
data=cursor.fetchall()
print(data)
conn.close()

[('Reshma',), ('mani',), ('Rajesh',), ('raj',), ('kalam',), ('Azula',), ('Bala',), ('gani',), ('Abi',)]

In [3]:
#how to display the date
import sqlite3
conn=sqlite3.connect("E:\\DBMS\\table2.sqlite")
cursor=conn.cursor()
query='''
select date('now')
'''
cursor.execute(query)
data=cursor.fetchall()
print(data)
conn.close()

[('2023-10-07',)]

In [4]:
#how to display the date and time
import sqlite3
conn=sqlite3.connect("E:\\DBMS\\table2.sqlite")
cursor=conn.cursor()
query='''
select datetime('now')
'''
cursor.execute(query)
data=cursor.fetchall()
print(data)
conn.close()

[('2023-10-07 14:31:49',)]

In [ ]:
#date related sqllite commands
'''
--displaying date as we given date format
--select strftime('%Y-%m-%d %H:%M:%S','now')

--to find  start of the current month 
--select strftime('%Y-%m-%d %H:%M:%S','now','start of month')

--finding after 6 days later date 
--select strftime('%Y-%m-%d','2023-10-08','6 days')

--using alias name to display date
--select strftime('%Y-%m-%d','2023-10-11','10 days') as 'Date';

--finding 5 days before date
--select strftime('%Y-%m-%d','2023-10-11','-5 days')

--display before 6 day from start of month
--select strftime('%Y-%m-%d','2023-10-08','start of month','-6 days')

--how to find out end of month
--select date('now','start of month','+1 month','-1 day')

--find next month and display 5 days later from next month
--select strftime('%Y-%m-%d','2023-10-08','start of month','+1 month','5 days') as 'Date';

/*The Julian Day (JD) is a continuous count of days since the beginning of the Julian Period, which started on January 1, 4713 BC (BCE) in the Julian calendar. 
It's a widely used system for specifying a date and time as a single integer number, particularly in astronomy and other scientific applications.*/
--select julianday('now') as 'julianday';
--select julianday('now','start of month') as 'julianday';


'''

In [ ]:
#delete the row using delete command
#delete from baby where Empid=6860(it's delete the row which has empid 6860)

In [4]:
#limit-limit clause is used to limit the data amount fetched by Select  command from a table
import sqlite3
conn=sqlite3.connect("E:\\DBMS\\table2.sqlite")
cursor=conn.cursor()
query="select * from baby6 limit 3"
cursor.execute(query)
data=cursor.fetchall()
print(data)
conn.close()
#it will fetch rows as we given limit

[(6860, 'karthik', 'chennai', 150000), (6862, 'Reshma', 'chennai', 100000), (6868, 'mani', 'madurai', 50000)]

In [3]:
#note=before performing union,unionall,inntersect,except,make sure both tables columns and rows should be same
#union-It is used to Combine the two tables and give only non-dublicate rows from both tables
import sqlite3
conn=sqlite3.connect("E:\\DBMS\\table2.sqlite")
cursor=conn.cursor()
query='''select * from baby6
union
select * from chennai
'''
cursor.execute(query)
data=cursor.fetchall()
print(data)
conn.close()

[(6822, 'Abi', 'chennai', 70000), (6832, 'gani', 'salem', 64000), (6855, 'Bala', 'coimbatore', 20000), (6859, 'Azula', 'salem', 18000), (6860, 'karthik', 'chennai', 150000), (6862, 'Reshma', 'chennai', 100000), (6868, 'mani', 'madurai', 50000), (6876, 'Rajesh', 'salem', 60000), (6877, 'raj', 'madurai', 230000), (6879, 'kalam', 'coimbatore', 10000)]

In [4]:
#union all-It is used to Combine the two tables and give all rows from both tables even dublicate rows
import sqlite3
conn=sqlite3.connect("E:\\DBMS\\table2.sqlite")
cursor=conn.cursor()
query='''select * from baby6
union all
select * from chennai
'''
cursor.execute(query)
data=cursor.fetchall()
print(data)
conn.close()

[(6860, 'karthik', 'chennai', 150000), (6862, 'Reshma', 'chennai', 100000), (6868, 'mani', 'madurai', 50000), (6876, 'Rajesh', 'salem', 60000), (6877, 'raj', 'madurai', 230000), (6879, 'kalam', 'coimbatore', 10000), (6859, 'Azula', 'salem', 18000), (6855, 'Bala', 'coimbatore', 20000), (6832, 'gani', 'salem', 64000), (6822, 'Abi', 'chennai', 70000), (6860, 'karthik', 'chennai', 150000), (6862, 'Reshma', 'chennai', 100000), (6822, 'Abi', 'chennai', 70000), (6868, 'mani', 'madurai', 50000), (6877, 'raj', 'madurai', 230000)]

In [5]:
#intersect-It is used to fetch only common values from both tables
import sqlite3
conn=sqlite3.connect("E:\\DBMS\\table2.sqlite")
cursor=conn.cursor()
query='''select * from baby6
intersect
select * from chennai
'''
cursor.execute(query)
data=cursor.fetchall()
print(data)
conn.close()

[(6822, 'Abi', 'chennai', 70000), (6860, 'karthik', 'chennai', 150000), (6862, 'Reshma', 'chennai', 100000), (6868, 'mani', 'madurai', 50000), (6877, 'raj', 'madurai', 230000)]

In [7]:
#except(like a difference in python)-table1 will compare with table2 and give only non duplicate value from table1
import sqlite3
conn=sqlite3.connect("E:\\DBMS\\table2.sqlite")
cursor=conn.cursor()
query='''select * from baby6
except
select * from chennai
'''
cursor.execute(query)
data=cursor.fetchall()
print(data)
conn.close()

[(6832, 'gani', 'salem', 64000), (6855, 'Bala', 'coimbatore', 20000), (6859, 'Azula', 'salem', 18000), (6876, 'Rajesh', 'salem', 60000), (6879, 'kalam', 'coimbatore', 10000)]

In [22]:
#symmentric difference-it's print all two tables value except what values are same in both tables.
import sqlite3
conn=sqlite3.connect("E:\\DBMS\\table2.sqlite")
cursor=conn.cursor()
query1= '''
    SELECT * FROM baby6
    EXCEPT
    SELECT * FROM baby3
    '''
query2='''
    SELECT * FROM baby3
    EXCEPT
    SELECT * FROM baby6
    '''
final_query=f'{query1} union {query2}'
cursor.execute(final_query)
data=cursor.fetchall()
print(data)
conn.close()
#note:above mentioned method was not working so we used next cell sqlite code for symmetric difference.

[]

In [19]:
#sqlite direct query
-- Create a temporary table to store the symmetric difference
-- between baby6 and chennai
CREATE TEMP TABLE temp_diff AS
SELECT * FROM baby6
EXCEPT
SELECT * FROM chennai;

-- Add rows from chennai that are not in baby6 to the temporary table
INSERT INTO temp_diff
SELECT * FROM chennai
EXCEPT
SELECT * FROM baby6;

-- Select the symmetric difference from the temporary table
SELECT * FROM temp_diff;

-- Drop the temporary table when done
DROP TABLE temp_diff;

In [28]:
#using python sqlite3 modukle ,we displaying symmetric_difference
import sqlite3

# Connect to the SQLite database
conn = sqlite3.connect("E:\\DBMS\\table2.sqlite")
cursor = conn.cursor()

# Step 1: Create a temporary table to store the symmetric difference
query1 = '''
    CREATE TEMP TABLE temp_ta AS
    SELECT * FROM baby6
    EXCEPT
    SELECT * FROM chennai
    '''
cursor.execute(query1)

# Step 2: Add rows from chennai that are not in baby6 to the temporary table
query2 = '''
    INSERT INTO temp_ta
    SELECT * FROM chennai
    EXCEPT
    SELECT * FROM baby6
    '''
cursor.execute(query2)

# Commit the changes to the database
conn.commit()

# Step 3: Select the symmetric difference from the temporary table
query3 = 'SELECT * FROM temp_ta'
cursor.execute(query3)
data = cursor.fetchall()
print(data)

# Close the database connection
conn.close()

[(6832, 'gani', 'salem', 64000), (6855, 'Bala', 'coimbatore', 20000), (6859, 'Azula', 'salem', 18000), (6876, 'Rajesh', 'salem', 60000), (6879, 'kalam', 'coimbatore', 10000)]

In [1]:
#how to read database data by pandas
import sqlite3
import pandas as pd
conn=sqlite3.connect('E:\\DBMS\\table2.sqlite')#existing data base file
data=pd.read_sql_query('select * from baby6',conn)
data
#here  fetched database data's

   EMP_ID EMP_NAME        CITY  SALARY
0    6860  karthik     chennai  150000
1    6862   Reshma     chennai  100000
2    6868     mani     madurai   50000
3    6876   Rajesh       salem   60000
4    6877      raj     madurai  230000
5    6879    kalam  coimbatore   10000
6    6859    Azula       salem   18000
7    6855     Bala  coimbatore   20000
8    6832     gani       salem   64000
9    6822      Abi     chennai   70000